In [54]:
import pandas as pd

In [55]:
file_one = "employee_data1.csv"
file_two = "employee_data2.csv"

In [56]:
file_one_df = pd.read_csv(file_one, encoding = "UTF-8")
file_two_df = pd.read_csv(file_two, encoding = "UTF-8")
file_one_df.head()

   Emp ID           Name         DOB          SSN         State
0     214  Sarah Simpson  1985-12-04  282-01-8166       Florida
1      15  Samantha Lara  1993-09-08  848-80-7526      Colorado
2     411  Stacy Charles  1957-12-20  658-75-8526  Pennsylvania
3     166   Michelle Roy  1978-07-29  794-25-3944      Michigan
4      39  Joseph Rogers  1985-03-28  525-40-3515     Minnesota

In [57]:
file_two_df.head()

   Emp ID              Name         DOB          SSN         State
0    1128  Jessica Sheppard  1970-05-24  223-55-4987  Rhode Island
1    1988   Sarah Rodriguez  1986-07-18  678-02-8700       Wyoming
2     573     Steven Parker  1981-09-20  808-05-5891      Nebraska
3     107  Patricia Bennett  1984-06-08  155-12-0424     Louisiana
4    2040       Lisa Mathis  1957-01-27  408-88-3247     Wisconsin

In [58]:
# To ensure that data is clean
file_one_df.count()

Emp ID    650
Name      650
DOB       650
SSN       650
State     650
dtype: int64

In [59]:
# To ensure that data is clean
file_two_df.count()

Emp ID    2120
Name      2120
DOB       2120
SSN       2120
State     2120
dtype: int64

In [60]:
# Create two new columns and split into first and last name 
file_one_df[['First Name', 'Last Name']] = file_one_df['Name'].str.split(expand=True)
file_one_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers

In [61]:
# Create two new columns and split 'Name' into first and last name 
file_two_df[['First Name', 'Last Name']] = file_two_df['Name'].str.split(expand=True)
file_two_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name
0,1128,Jessica Sheppard,1970-05-24,223-55-4987,Rhode Island,Jessica,Sheppard
1,1988,Sarah Rodriguez,1986-07-18,678-02-8700,Wyoming,Sarah,Rodriguez
2,573,Steven Parker,1981-09-20,808-05-5891,Nebraska,Steven,Parker
3,107,Patricia Bennett,1984-06-08,155-12-0424,Louisiana,Patricia,Bennett
4,2040,Lisa Mathis,1957-01-27,408-88-3247,Wisconsin,Lisa,Mathis

In [62]:
# Create three new columns and split 'SSN' by hyphen 
file_one_df[['First part of SSN', 'Middle part of SSN', 'Last part of SSN']] = file_one_df['SSN'].str.split("-", expand=True)
file_one_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson,282,01,8166
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara,848,80,7526
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles,658,75,8526
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy,794,25,3944
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers,525,40,3515

In [63]:
# Create three new columns and split 'SSN' by hyphen 
file_two_df[['First part of SSN', 'Middle part of SSN', 'Last part of SSN']] = file_one_df['SSN'].str.split("-", expand=True)
file_two_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,1128,Jessica Sheppard,1970-05-24,223-55-4987,Rhode Island,Jessica,Sheppard,282,01,8166
1,1988,Sarah Rodriguez,1986-07-18,678-02-8700,Wyoming,Sarah,Rodriguez,848,80,7526
2,573,Steven Parker,1981-09-20,808-05-5891,Nebraska,Steven,Parker,658,75,8526
3,107,Patricia Bennett,1984-06-08,155-12-0424,Louisiana,Patricia,Bennett,794,25,3944
4,2040,Lisa Mathis,1957-01-27,408-88-3247,Wisconsin,Lisa,Mathis,525,40,3515

In [66]:
file_one_df['Last part of SSN'] = '***-**-' + file_one_df['Last part of SSN'].astype(str)
file_one_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,214,Sarah Simpson,1985-12-04,282-01-8166,Florida,Sarah,Simpson,282,01,***-**-8166
1,15,Samantha Lara,1993-09-08,848-80-7526,Colorado,Samantha,Lara,848,80,***-**-7526
2,411,Stacy Charles,1957-12-20,658-75-8526,Pennsylvania,Stacy,Charles,658,75,***-**-8526
3,166,Michelle Roy,1978-07-29,794-25-3944,Michigan,Michelle,Roy,794,25,***-**-3944
4,39,Joseph Rogers,1985-03-28,525-40-3515,Minnesota,Joseph,Rogers,525,40,***-**-3515

In [68]:
file_two_df['Last part of SSN'] = '***-**-' + file_two_df['Last part of SSN'].astype(str)
file_two_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,1128,Jessica Sheppard,1970-05-24,223-55-4987,Rhode Island,Jessica,Sheppard,282,01,***-**-8166
1,1988,Sarah Rodriguez,1986-07-18,678-02-8700,Wyoming,Sarah,Rodriguez,848,80,***-**-7526
2,573,Steven Parker,1981-09-20,808-05-5891,Nebraska,Steven,Parker,658,75,***-**-8526
3,107,Patricia Bennett,1984-06-08,155-12-0424,Louisiana,Patricia,Bennett,794,25,***-**-3944
4,2040,Lisa Mathis,1957-01-27,408-88-3247,Wisconsin,Lisa,Mathis,525,40,***-**-3515

In [69]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [71]:
file_one_df['State'].replace(us_state_abbrev, inplace = True)
file_one_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,214,Sarah Simpson,1985-12-04,282-01-8166,FL,Sarah,Simpson,282,01,***-**-8166
1,15,Samantha Lara,1993-09-08,848-80-7526,CO,Samantha,Lara,848,80,***-**-7526
2,411,Stacy Charles,1957-12-20,658-75-8526,PA,Stacy,Charles,658,75,***-**-8526
3,166,Michelle Roy,1978-07-29,794-25-3944,MI,Michelle,Roy,794,25,***-**-3944
4,39,Joseph Rogers,1985-03-28,525-40-3515,MN,Joseph,Rogers,525,40,***-**-3515

In [72]:
file_two_df['State'].replace(us_state_abbrev, inplace = True)
file_two_df.head()

,Emp ID,Name,DOB,SSN,State,First Name,Last Name,First part of SSN,Middle part of SSN,Last part of SSN
0,1128,Jessica Sheppard,1970-05-24,223-55-4987,RI,Jessica,Sheppard,282,01,***-**-8166
1,1988,Sarah Rodriguez,1986-07-18,678-02-8700,WY,Sarah,Rodriguez,848,80,***-**-7526
2,573,Steven Parker,1981-09-20,808-05-5891,NE,Steven,Parker,658,75,***-**-8526
3,107,Patricia Bennett,1984-06-08,155-12-0424,LA,Patricia,Bennett,794,25,***-**-3944
4,2040,Lisa Mathis,1957-01-27,408-88-3247,WI,Lisa,Mathis,525,40,***-**-3515

In [75]:
organized_one = file_one_df[['Emp ID', 'First Name', 'Last Name', 'DOB', 'Last part of SSN', 'State']]
organized_one.head()

   Emp ID First Name Last Name         DOB Last part of SSN State
0     214      Sarah   Simpson  1985-12-04      ***-**-8166    FL
1      15   Samantha      Lara  1993-09-08      ***-**-7526    CO
2     411      Stacy   Charles  1957-12-20      ***-**-8526    PA
3     166   Michelle       Roy  1978-07-29      ***-**-3944    MI
4      39     Joseph    Rogers  1985-03-28      ***-**-3515    MN

In [76]:
organized_two = file_two_df[['Emp ID', 'First Name', 'Last Name', 'DOB', 'Last part of SSN', 'State']]
organized_two.head()

   Emp ID First Name  Last Name         DOB Last part of SSN State
0    1128    Jessica   Sheppard  1970-05-24      ***-**-8166    RI
1    1988      Sarah  Rodriguez  1986-07-18      ***-**-7526    WY
2     573     Steven     Parker  1981-09-20      ***-**-8526    NE
3     107   Patricia    Bennett  1984-06-08      ***-**-3944    LA
4    2040       Lisa     Mathis  1957-01-27      ***-**-3515    WI